.planning/case_profiles/case_022_v64_val_full_5_bfs_dicts/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Web:      www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
// U_ref = 44.2 m/s · x-direction · Driver-Seegmiller 1985 canonical inflow
// Uniform inlet (per briefing reverse condition "uniform inlet + 长 inlet
// section" sanction; canonical experimental BL δ/h≈1.5 not reproduced)
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (44.2 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (44.2 0 0);
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           uniform (44.2 0 0);
    }
    topWall
    {
        type            noSlip;
    }
    bottomUpstream
    {
        type            noSlip;
    }
    stepWall
    {
        type            noSlip;
    }
    bottomDownstream
    {
        type            noSlip;
    }
    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
