.planning/case_profiles/case_022_v64_val_full_5_bfs_dicts/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Web:      www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
// Turbulent kinematic viscosity · noSlip walls use nutUSpaldingWallFunction
// for y+≈1 auto-blending (works in viscous-sublayer AND log-law regimes)
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 0;
    }
    outlet
    {
        type            calculated;
        value           uniform 0;
    }
    topWall
    {
        type            nutUSpaldingWallFunction;
        value           uniform 0;
    }
    bottomUpstream
    {
        type            nutUSpaldingWallFunction;
        value           uniform 0;
    }
    stepWall
    {
        type            nutUSpaldingWallFunction;
        value           uniform 0;
    }
    bottomDownstream
    {
        type            nutUSpaldingWallFunction;
        value           uniform 0;
    }
    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
