.planning/case_profiles/case_022_v64_val_full_5_bfs_dicts/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Web:      www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
// case_022 · simpleFoam steady RANS · 5000-iter cap · NASA TMR canonical
// function objects: wallShearStress (Cf), wallPressure (Cp), yPlus, solverInfo
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}

application     simpleFoam;

startFrom       startTime;
startTime       0;

stopAt          endTime;
endTime         5000;

deltaT          1;

writeControl    timeStep;
writeInterval   500;

purgeWrite      2;

writeFormat     ascii;
writePrecision  10;
writeCompression off;

timeFormat      general;
timePrecision   6;

runTimeModifiable true;

functions
{
    // Wall shear stress (kinematic m²/s²) on all noSlip walls — Cf extraction
    wallShearStress1
    {
        type            wallShearStress;
        libs            (fieldFunctionObjects);
        writeControl    onEnd;
        writeFields     true;
        log             true;
        patches         (bottomUpstream stepWall bottomDownstream topWall);
    }

    // y+ (dimensionless wall distance, first cell center) — for FULL gate verify
    yPlus1
    {
        type            yPlus;
        libs            (fieldFunctionObjects);
        writeControl    onEnd;
        writeFields     true;
        log             true;
    }

    // Residual extraction for convergence verification (all 5 fields + continuity)
    residuals1
    {
        type            solverInfo;
        libs            (utilityFunctionObjects);
        fields          (p U k omega);
        writeResidualFields false;
        writeControl    timeStep;
        writeInterval   1;
    }
}

// ************************************************************************* //
